[{"author":null,"categories":["Blog"],"content":"自从辞职专门从事投资以来，读过的投资书没有上百本也有几十本了。就像那句成语说的：开卷有益，我从每本书中都或多或少有所收获。\n但是有那么几本书在很大程度上改变了我。通过它们我形成了自己的投资理念，建立了投资体系，进而带来了还算不错的投资业绩。\n这些书有一些共同的特点：\n会带来巨大的认知升级： 这是好书相对于一般书的主要区别。 读完这些书相当于你提升了一个纬度，从更高的纬度看待世界就像手里拿着一张地图走迷宫一样。 会马上带来行动： 真正的好书不仅仅是讲清楚一个道理，带来认知上的提升，而是会立即产生行动。如果一本书不能带来行动，那么要么它要表达的观点不重要，要么就是讲的不透彻。 下面我推荐的书基本上都符合这一特点。 浅显易懂： 这些书没有复杂的数学公式，没有高深的理论，更没有行业术语和黑话，而是用最通俗易懂的语言反复说明一两个道理，即使你是投资小白也完全能看懂。 接下来就是我的推荐（按照阅读的顺序排列）。\n《穷爸爸，富爸爸》 这是我读的第一本投资方面的书籍，也是我的投资启蒙书。\n作者罗伯特·清崎用他自己的成长经历，用对他影响最深的两位爸爸的例子，清楚地说明了一个道理：\n靠打工永远没法致富，只有靠投资才能实现财务自由。\n这本上个世纪九十年代出版的图书观念非常超前，现在耳熟能详的很多概念，例如“财务自由”、“睡后收入”等等基本上都来自于这本书。\n我自己非常幸运地很早就读到了这本书，能够在职场的早期就有了投资意识。相对于很多工作了一辈子的人，可能直到退休也没有意识到自己一直困在“老鼠赛跑”的循环里。\n更为重要的是读完这本书直接带来了行动（就像这篇文章里提到的所有投资书一样）。罗伯特·清崎在书里特别推崇房地产投资的方式，受他的影响我也很早开始了我的房产投资。\n现在回想起来，在2000年初投资房产简直就像无风险套利。花20%的首付买一套房子，简单装修、配一些家具就能很快出租出去，每月的租金可以轻松覆盖按揭贷款，相当于租客帮你支付房贷。而在那个时候正是中国房市起步不久的阶段，投资的房产价格不断上涨，最后都能以很高的价格出手。考虑到只用支付首付，等于使用了杠杆，最后每套房子都能实现五倍以上的收益。\n虽然后来因为种种原因只投资了两套房子，没有实现预定计划，但还是取得了不错的收益，取得了投资道路上的首场胜利。\n《战胜华尔街》 作者彼得·林奇是史上最传奇的基金经理之一，他在担任麦哲伦基金经理 …","date":1707424560,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":2600,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1707424560,"objectID":"1b34062f8a344478622e4cf81a7aad13","permalink":"https://bruce-qiao.github.io/post/recommended-investment-books/","publishdate":"2024-02-08T20:36:00Z","readingtime":6,"relpermalink":"/post/recommended-investment-books/","section":"post","tags":["投资 个人成长 认知"],"title":"那些改变了我的投资书","type":"post","url":"/post/recommended-investment-books/","weight":0,"wordcount":2507},{"author":null,"categories":["认知"],"content":"这篇文章是如何创造财富系列文章的第三篇。\n在开始之前先来回顾一下前两篇文章。\n第一篇是从创业的角度。创业者创造财富有两种途径：第一种是利用创业者本人和创业团队的劳动力和时间，第二种是利用独有的技术优势。这两种途径本质上都是利用了杠杆，第一种是劳动力杠杆，这也是最古老、最原始的杠杆；第二种是技术杠杆，这点在互联网时代体现的最明显，好的代码（包括书籍、媒体等）复制的边际成本为零，你可以很轻松地将你的劳动成果放大成百上千倍。\n第二篇是从投资的角度。除了劳动力杠杆和技术杠杆之外，20世纪应用最广的应该就是资本杠杆了。可是普通人很难获得资本杠杆，因此文章介绍了期权这样的具有不对称性的杠杆工具，如果运用得当，可以获得惊人的财富增长。\n在上一篇文章的最后我写了这样一句话：\n实际上对于普通人来说，投资于自己知识和能力的提升是投资回报率最高的投资。\n这无疑是一句正确的废话。提升自己的知识和能力在任何时候、任何条件下都是对的，可它和我们之前说的杠杆有什么联系？为什么说它是投资回报率最高的投资？\n这个问题一直困惑着我，直到前不久从一本书里找到了答案。这本书就是《纳瓦尔宝典》。\n《纳瓦尔宝典》是硅谷知名创业家、投资人纳瓦尔·拉维坎特过去十年里通过推特、播客和采访等方式分享的人生智慧集合。纳瓦尔本人是印度移民，出身贫苦的单亲家庭，凭借个人的努力创业成功，成为著名的企业家和投资人。\n在我看来，纳瓦尔和如何创造财富系列文章第一篇中介绍的《黑客和作家》作者保罗·格雷厄姆很相像。两个人都是成功创业，后来成为了投资人（格雷厄姆是YC孵化器的创始人，纳瓦尔是AngelList的创始人）。更重要的是两人都酷爱阅读、喜欢思考并且乐于分享，并且因此在硅谷和科技界具有很大的影响力。这两本书汇聚了两位企业家的思想精华，非常值得一读。\n《纳瓦尔宝典》分为财富和幸福两个部分。事实上纳瓦尔关于如何获得幸福的观点给我很大的启发，但这部分不是这篇文章的重点。\n在财富部分，纳瓦尔强调了杠杆对于创造财富的重要性，同时他还特别强调了判断力的关键作用：\n杠杆是判断力的倍增器。\n这句话解答了我之前的困惑。杠杆只是放大器，真正起关键作用的是判断力，而提升知识和能力（也可以统称为认知能力）的目的就是提升判断力。\n往具体的说：杠杆是一个工具，它本身是中性的，既可以把好的结果放大，也可以将坏的放大。杠杆确实很重要，但不是关键因素。如果具有优 …","date":1672737780,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":3100,"html":"杠杆是判断力的倍增器。","keywords":null,"kind":"page","lang":"en","lastmod":1672737780,"objectID":"859a6304946b638bc3fd9cd220399f61","permalink":"https://bruce-qiao.github.io/post/how-to-make-wealth3/","publishdate":"2023-01-03T09:23:00Z","readingtime":7,"relpermalink":"/post/how-to-make-wealth3/","section":"post","tags":["投资","认知能力","如何创造财富"],"title":"如何创造财富（三）","type":"post","url":"/post/how-to-make-wealth3/","weight":0,"wordcount":3054},{"author":null,"categories":["Blog"],"content":"由于懒以及拖延症的原因，去年没有写总结。\n由于同样的原因，今年的总结被拖到现在。但2021年的总结无论如何必须要写，因为2021年是我辞职在家的第七年，按照笑来老师“七年就是一辈子”的说法，我刚刚过完上一辈子，所以这是一篇上一辈子的总结。\n回顾 从结果看，我的上一辈子收获很多：达成了财务自由的目标；认知水平有了很大提升；学习了英语、编程等很多技能；内心相比七年前也更加平静、从容。\n但结果不是一蹴而就的。\n2015年，也是刚辞职的第一年。怀着对未来巨大不确定性的恐惧，带着对快速成功不切实际的幻想，迎来了这一年过山车似的的股市行情。虽然凭借着对价值投资原则的坚持、保守谨慎的性格，到年底还略有盈余，但相对那时给自己定的虚高目标，还是感到深深的挫败感。\n现在看来，当时之所以有一夜暴富的想法根源在于认知不足，更没有过往的成功案例。\n\u0026amp;ldquo;目光短浅\u0026amp;quot;的根源总是一样的：急切地想要改变现状。但若把“现状”清楚地定义为“过往的积累”，我们就会明白“马上改变现状”的难度。 —— 李笑来 《财富自由之路》\n2015年的一个收获是在迷茫、焦虑的同时看了很多书，有点像笑来老师说的苍蝇模式，希望从书中找到答案和方向。\n2016年是关键的一年。年初通过罗胖的跨年演讲无意中知道了《把时间当作朋友》这本书。\n这本书通篇讲了一个道理，就是耐心。归结为一句话就是：\n一切全凭积累，速成绝无可能。\n投资成功、认知升级以及掌握任何一项复杂的技能的过程都符合下面的复利曲线，都要经历一段漫长、难熬的积累期，绝大多数人在这个时期就早早放弃了，而一旦熬过了这个阶段就会迎来加速增长。\n提升认知的好处之一是让你能够看到别人看不到的事并因此采取行动。总之，这本书极大地改变了我。好像一夜之间我变得不再焦虑，对未来也没有那么恐惧。之后受笑来老师的影响开始学习英语、编程以及后来的区块链，开始了自己的积累之路。\n2017年继续看书、学习。这一年我第一次接触到了期权，很快就被它不对称杠杆的特点吸引。这不就是我一直寻找的普通人实现财务自由的最佳手段吗？很幸运的是在这一年利用期权工具抓住了英伟达的机会，实现了第一次大的财富增长。\n2018年遭遇了股市和比特币的双双不景气，第一次出现了全年收益为负的情况。但这时候的心态已经和几年前大不一样，在检查过自己的投资策略后，继续该干嘛干嘛。现在回想起来，这应该算是黎明前的黑暗。 …","date":1645093560,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":1800,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1645093560,"objectID":"0a95ad75d03dc3956611145c489ba124","permalink":"https://bruce-qiao.github.io/post/2021recap/","publishdate":"2022-02-17T10:26:00Z","readingtime":4,"relpermalink":"/post/2021recap/","section":"post","tags":["认知能力"],"title":"2021年总结","type":"post","url":"/post/2021recap/","weight":0,"wordcount":1730},{"author":null,"categories":["Blog"],"content":"《Atomic Habits》是一本介绍如何培养习惯的书。出版以后在国外影响很大，许多媒体、大V都推荐过。相反在国内除了樊登大力推荐外（国内翻译为《掌控习惯》），似乎没有得到应有的重视。\n书的内容不是很多，但兼具科学性和实用性，几乎涵盖了习惯养成的各个方面。以下是我阅读这本书的一些感受和思考。\n习惯为什么重要？ 很多人都见过下面这张图：\n这是一个指数增长曲线，经常用来表示复利效应。\n在日常生活中有很多复利效应的例子，例如：\n知识或技能的增长 财富的积累 网站用户或粉丝的增长 技术进步（摩尔定律） 初创企业盈利增长 这张图要表达的意思很明确，就是每天微小的行动（习惯）经过长期累积会带来巨大的变化。\n也可以换一个角度理解习惯的重要性。\n还是刚才的指数增长曲线，只是增加了一些注释。\n所有具有复利效应的事情都有一个共同的特点，就是在很长的一段时间内看不到回报，甚至结果低于预期（图中的失望之谷）。\n当你最终突破潜能蓄积期之际，人们会称之为一夜之间的成功。外部世界只看到最具戏剧性的薄发一瞬间，而无视之前厚积的漫长过程。但是你要知道，正是你很久以前下的那些功夫才使得今天的飞跃成为可能。\n能否熬过这个阶段是成功者和失败者的主要差别。\n通过养成习惯可以帮助你更好地坚持，实现长期目标。\n习惯是一种常常出现的行为，而且常常是在无意识下出现。 \u0026amp;mdash;维基百科\n一年读十本书可能听起来有些吓人，但一天读一个章节甚至一页内容基本上每个人都能做到。你要做的就是把一个大目标分解到每天，然后变成像刷牙、洗脸这样的习惯就行。\n什么是Atomic？ 《Atomic Habits》直译过来是《原子习惯》。这里原子有两层意思：\n第一层是微小的意思。\n作者举了一个他自己的例子。作者在高中时代经历一次严重的意外，迫使他离开了喜爱的棒球场。上大学后作者决心通过自己的努力进入校棒球队。他采用的第一个行动看起来微不足道，就是按时作息并且整理好自己的房间。在大学宿舍混乱、嘈杂，周围同学通宵打游戏的环境中坚持自己的习惯给了作者一种可以掌控自己生活的感觉，他开始慢慢重拾信心，最终达成了自己的目标。\n第二层是基本组成单元的意思。\n就像原子是所有物质构成的要素。作者也总结了构成习惯的四个基本要素：\n提示 渴求 反应 奖励 并且提出对应以上四个基本要素的四个习惯养成方法：\n让它显而易见 让它有吸引力 让它简便易行 让它令人 …","date":1614026700,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":2200,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1614026700,"objectID":"a02a9ca0e91bfd4598ea4ca17a5ec3be","permalink":"https://bruce-qiao.github.io/post/atomic-habits_note/","publishdate":"2021-02-22T20:45:00Z","readingtime":5,"relpermalink":"/post/atomic-habits_note/","section":"post","tags":["生产力","认知能力"],"title":"《Atomic Habits》读书笔记","type":"post","url":"/post/atomic-habits_note/","weight":0,"wordcount":2142},{"author":null,"categories":["Blog"],"content":"《会走路的钱》是美籍华人贝版写的关于投资理财的书，书中记录了作者作为90年代从大陆移民美国的普通华人家庭十年时间（实际上超过了十年）资产从零到一千万美金的具体过程，书中也介绍了作者很多关于投资理财的理念和思考。\n在如此短的时间实现巨大的资产增值无论在任何国家和地区都是一个奇迹，作者关于投资的理念和行动无疑非常值得借鉴。以下是我阅读这本书的一些感受和思考。\n钱会自己走路 就像书名说的，作者的核心观点之一就是钱是有腿的，它会自己走路。原因如下：\n通货膨胀\n这个很容易理解：由于通货膨胀的原因，你口袋或账户里的钱会不知不觉地溜走。\n相对增长率\n每个国家、地区和行业在同一时期都有不同的增长率，例如过去三十年的中国和全世界范围内的IT行业的增长率都远远高于其他国家和行业，选择对了国家、地区和行业就能获得相对高的财富增长率。这有点类似这两年经常说的风口说法。\n旧钱与新钱\n旧钱是指现有的财富，新钱是随着社会进步、新技术出现带来的新的财富。\n作者提出不要和旧钱拼实力，而是要提前布局新钱要去的地方。\n举例来说，如果投资房地产，不要投资已经成熟的物业，而是提前布局未来有可能升值的房产，比如年轻人聚集的地方，这些地方现在的房价可能不高，但随着年轻人收入的增长，会有更大的升值潜力。\n作者还举了比特币的例子。比特币作为一种全新的数字虚拟货币，开始只有少数极客理解和持有，这个时候持有的成本较低。随着这些技术天才慢慢变得富有以及被更多大众接受，比特币会越来越值钱。\n懒人投资法 vs 勤快人投资法 懒人投资法\n主要是指定投股票基金。好处是不用花费额外的时间和精力，长期看收益不错，回报率大概率打败绝大多数主动投资（巴菲特用十年时间做了一个试验验证了这一点）；缺点是回报率一般。\n勤快人投资法\n这是作者最推崇的投资方式，主要是指投资房地产。\n具体做法是利用贷款杠杆尽可能多的投资房产，尽量用租金覆盖贷款，在房产升值后重新抵押贷款买更多的房子。这种方式的优点是回报率较高，缺点是比较辛苦，需要不停地看房、买房、装修、找租客、收租金甚至修马桶（美国人工很贵），所以是适合勤快人的投资法，这也是作者实现财富增长的主要方式，书里有大量的方法和实际案例介绍。\n我的想法：\n勤快人投资法之所以比懒人投资法回报率高，原因主要是房产投资可以使用杠杆。\n在之前的文章中曾经提到杠杆可以大幅提高总体投资回报，是普通人实现财富逆袭的重要 …","date":1594324380,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":3700,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1594324380,"objectID":"6ce35664d40c5e5cba72b2cb773be8e7","permalink":"https://bruce-qiao.github.io/post/money-walks_note/","publishdate":"2020-07-09T19:53:00Z","readingtime":8,"relpermalink":"/post/money-walks_note/","section":"post","tags":["投资理财","认知能力"],"title":"《会走路的钱》读书笔记","type":"post","url":"/post/money-walks_note/","weight":0,"wordcount":3677},{"author":null,"categories":["Blog"],"content":"2020年春节注定将成为一个让人难忘的新年。突如其来的病毒一夜之间让往日浮躁、喧嚣的十几亿国人被迫过上了深居简出，天天和家人团圆的日子，想象不出除了可能致死的病毒还有什么可以做到这一点。生活习惯的急剧变化带来一些意想不到的结果，比如这篇原本可能不存在的总结。\n下面继续从认知、投资、学习和生活几个方面回顾一下过去的一年。\n认知 今年认知方面的一大收获是老喻的《人生算法课》。\n老喻虽然年纪不大，但已经是一个成功的连续创业者，财务自由后举家移民加拿大。在好山好水好寂寞的加拿大老喻通过大量的阅读，总结自己十几年创业的经验、教训，不断丰富和完善自己的人生算法。因此这门课可以说是理论和实践相结合的产物。\n这门课我前后听了至少三遍，除了内容好的因素之外，听的时候经常走神也是重要原因，所以即使听过这么多遍，在写这个总结的时候还是忘记了绝大多数内容。\n能记住的或者说印象最深的有三点：\n一是特别强调不确定性以及应对方法；\n二是特别强调反馈和犯错的重要性；\n三是特别强调概率和统计的作用。对我的直接影响是现在开始阅读、学习这方面的书籍。\n希望今后可以专门写一篇关于这门课程的文章。\n投资 2019年从投资收益的角度绝对称得上是一个丰收年，一年的收益超过了之前若干年所有投资收益的总和，这也符合长期投资收益呈现指数增长的特点。\n能够获得如此高收益绝对有运气的因素，但也和坚持长期投资实现复利增长以及投资理念、投资手段的日益成熟密切相关。\n去年构成收益最大的部分是美股期权，具体说就是特斯拉的期权。特斯拉的股票我持有超过五年时间，绝对称得上长期投资。虽然这是一只成长股，但在这五年中的大部分时间它的股价都是波澜不惊，直到2019年年底伴随业绩增长迎来了股价的大爆发。\n即使在2019年特斯拉的股价也经历了过山车般的剧烈波动，最低点不到每股200美金，甚至低于我五年前的买入成本。\n股价大幅下跌带来绝佳的机会，极度恐慌的市场使我能够以极低的成本建仓，配合期权这种低风险、高杠杆工具最终实现了超额收益。\n辞职在家的五年中对我影响最大的一本书是李笑来的《把时间当作朋友》（关于这本书对我的影响可以参考这篇文章：新生周年记）。这本书的核心观点概括成一句话就是：\n一切全凭积累，速成绝无可能。\n说白了就是相信时间的价值，巧的是期权盈利的核心正是时间的价值！（关于期权的介绍可以参考我之前的文章：如何创造财富(续)）相信并利用 …","date":1581368880,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":1600,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1581368880,"objectID":"19e058d1c716759a741be20bda671630","permalink":"https://bruce-qiao.github.io/post/2019recap/","publishdate":"2020-02-10T21:08:00Z","readingtime":4,"relpermalink":"/post/2019recap/","section":"post","tags":["认知能力"],"title":"2019年总结","type":"post","url":"/post/2019recap/","weight":0,"wordcount":1587},{"author":null,"categories":["Blog"],"content":"2018年的总结拖到现在才写除了拖延症发作的原因，还有一个重要的理由是感觉去年没有什么明显的收获，\b过去的一年既不像2016年有了巨大的认知升级，也不像2017年收获较大的投资收益，实在是乏善可陈的一年。\n可是仔细想想这样的想法是不对的。一年\b即使在\b不长的人生中也不是一个很长的\b单位，对于投资等长期目标更是如此。指望每一年都有大的收获是急功近利的表现，既然选择了做时间的朋友，就更应该接受付出在短期内无法获得有效反馈的\b现实和客观规律。\n在这样的认知下年度总结的目的就变得非常清楚：定期检查实现长期目标的路径和方法是否正确？\b执行过程中有没有问题？是否需要调整甚至改变？如果确定大的方面没有问题，接下来要做的无非就是继续坚持，静待结果出现的那一天。\n下面就从认知、投资、学习和生活四个方面总结一下我的2018年。\n认知 一直以来对于如何\b获得幸福这一话题非常感兴趣，这毕竟是所有人生的终极目标。去年看了一些书、听了\b几个讲座，获得了一些和\b常识截然不同的观念。比如幸福\b感完全是个主观概念，和金钱、地位等客观条件毫无关系。明白了这个原理，我们就不难理解：”一箪食，一瓢\b饮，在陋巷，人不堪其忧，回也不改其乐。“，也不难理解为什么有些人在遭遇了重大的个人、家庭不幸后仍能够\b幸福地度过一生，而有些人过着锦衣玉食的生活仍然无法获得内心的平静和满足。同时既然幸福感完全来自主观，我们完全可以通过一些方法提升我们的幸福感，而不用依赖外在环境。\n由于篇幅的原因这里可能无法详细展开，后续希望\b像投资一样写成一系列的文章。\n投资 单从结果看2018年的投资业绩非常不好，可能是我开始投资以来唯一亏损的一年。可是经过复盘发现在过去一年并没有\b重大的决策失误。亏损的原因首先是大势的原因，下图\b很具有说服力：\n\bA股虽然排在资产收益率倒数第二名，但由于我之前一直判断国内股市估值过高，目前的仓位都是2015年股灾后建立的，\b选取的标的也都是低市盈率、高分红的蓝筹股，反而在去年没有损失。\n美股比较惨，重仓的两只股票全部\b跌破买入价，目前处于套牢阶段。经过反思我认为现在和建仓时相比，买入逻辑并没有\b发生大的变化，所以\b\b暂时抑制住了自己事后诸葛亮的冲动，准备再看一个阶段再总结。\n\b亏损的第二个原因是投资了去年熊冠全球的比特币。虽然在买入前进行了较深入的研究，个人对其前景也很有信心，但还是很好地执行了投资纪律： …","date":1546444380,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":2200,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1546444380,"objectID":"aacbf8f2084af7aec045d94efafa24a6","permalink":"https://bruce-qiao.github.io/post/2018recap/","publishdate":"2019-01-02T15:53:00Z","readingtime":5,"relpermalink":"/post/2018recap/","section":"post","tags":["认知能力"],"title":"2018年总结","type":"post","url":"/post/2018recap/","weight":0,"wordcount":2171},{"author":null,"categories":["Blog"],"content":"这篇文章的灵感来自于一本书：《How an economy grows and why it crashes》，中文版叫《小岛经济学》。这本书用寓言的方式解释了很多经济学原理，非常轻松易懂，墙裂推荐一读。\n在书的第一章讲一个小岛上住着三个人：艾伯、贝克和查理。岛上生活很艰苦，三个人都靠打鱼为生。由于缺乏工具，只能徒手抓鱼，每人幸幸苦苦一天下来只能捕到一条鱼，这一条鱼刚好够他们每人吃一天。\n在一个貌似平淡无奇、千篇一律的日子，结束了一天辛苦的捕鱼工作后，艾伯躺在沙滩上突然有了一个主意：能不能发明一个捕鱼器？这样他就可以在较短的时间捕到更多的鱼了，这样他就有空余时间干点儿其他的事情，比如画画、唱歌什么的。\n说干就干。第二天一早艾伯就用棕榈树皮搓成绳子开始制作他的捕鱼器。贝克和查理看到艾伯没有开始捕鱼感到很奇怪，在了解了艾伯的想法后两人都觉得他们的朋友一定是疯了，并且表示如果艾伯的捕鱼器失败了他们不会给他一片鱼。\n艾伯没有被他的朋友们吓倒，继续制作他的捕鱼器。到这一天结束时小岛第一个捕鱼器诞生了。当然艾伯做出了牺牲，他这一天没有捕鱼，当然也无法吃鱼。\n在这个简单的任务中，艾伯向我们展示了一个基本的经济原则，这个原则可以提高人们的生活水平，甚至可以帮助人们实现财务自由；这个原则同时也是本篇文章想要传递的中心思想。这个原则由两方面构成：\n抑制消费（Underconsumption） 适当冒险（Risktaking） 抑制消费 为了制作捕鱼器，艾伯那天就无法捕鱼。他这样做并不是因为他不需要鱼，事实上他和他的两个朋友一样爱吃鱼。艾伯之所以选择暂时抑制消费，或者说延迟消费，目的是为了将来消费更多。\n适当冒险 除了抑制消费，艾伯还需要冒险。因为他不知道自己做的捕鱼器能否有用。自己花费了一天的时间饿着肚子辛苦劳动，却不知道这东西究竟能不能补偿所失。如果捕鱼器失败，最后的结果只可能是一把绳子和一个饿瘪的胃，当然还少不了贝克和查理的冷嘲热讽。\n艾伯通过抑制消费和适当冒险创造了资本。\n在经济学术语中，资本指的是一种设备，这种设备的建设和使用本身没有什么意义，其意义在于利用设备建设和制造其他需要的东西。\n艾伯想要的不是捕鱼器，而是鱼。捕鱼器或许可以给他带来更多的鱼。因此，捕鱼器就是一种资本。\n后面的结果如你所料，艾伯的捕鱼器大获成功，现在他一天可以轻松地捕到两条鱼，贝克和查理这才醒悟过来，他俩 …","date":1543095300,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":2000,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1543095300,"objectID":"db9ab67035bc15371cfedd9276f161ce","permalink":"https://bruce-qiao.github.io/post/financialfreedom/","publishdate":"2018-11-24T21:35:00Z","readingtime":4,"relpermalink":"/post/financialfreedom/","section":"post","tags":["投资","认知能力"],"title":"普通人如何实现财务自由","type":"post","url":"/post/financialfreedom/","weight":0,"wordcount":1925},{"author":null,"categories":["Blog"],"content":"在如何创造财富这篇文章里介绍了Paul Graham的观点，主要是讲如何通过创业创造财富。今天聊聊如何通过投资达到财富快速增长的目标。\n学过财务分析的应该很熟悉经典的杜邦公式：\n净资产收益率(ROE) = 净利率 × 周转率 × 杠杆率\n杜邦公式之所以经典是因为它提供了一个快速、清晰地分析企业的方法。它的要点如下：\n净资产收益率又叫股东权益报酬率，简单地说就是一项生意投入了多少本金（不考虑贷款等融资），一年内能赚多少钱，是衡量企业盈利能力的终极指标。一般来说净资产收益率在15%以上的都算不错的企业； 净利率是衡量企业赚钱能力的重要指标，反映了行业特点和企业的独特优势。例如茅台的净利率高达44.7%，而格力虽然在家电企业中算得上非常优秀，净利率也只有14.1%，很多处在激烈竞争行业的企业净利率只有个位数； 周转率是指在同样条件下一年可以做几次生意。一般来说高净利和奢侈品的企业周转率都不高，所谓“半年不开张，开张吃三年”就是指这类企业，例如茅台的周转率只有0.4，也就是说相对于总资产一年只能周转0.4次；通路企业和生产快销品的企业周转次数较多，比如苏宁云商周转率为1.3； 杠杆率是指总资产相当于净资产的倍数，多于净资产的部分可以是贷款也可以是占用供应商或他人的资金。银行虽然自有资金也不少，可是相对于庞大的总资产仍是很小一部分，更多的是吸收企业和个人的存款来开展业务； 三者相乘得到最终的净资产收益率。仔细分析等式右边的三个因素可以得出企业的不同特点。 对于个人投资收益分析和以上的道理是一样的：\n投资收益 = 单次投资收益 × 周转率 × 杠杆率\n下面来具体分析：\n单次投资收益： 这个很容易理解，就是一项投资的整体收益情况。受企业盈利增长的限制，一般说来这个数字很难做到很高，对于成熟行业来说一年盈利增长达到两位数几乎已经是极限了，对于极个别高速成长的企业能够达到三位数，笑来老师投资比特币获得上千倍的收益更是百年难遇、可遇不可求的案例。选中这些企业（标的）需要非常前瞻的眼光，同时也有可能面临非常大的风险。\n周转率： 周转率从字面上也很容易理解，就是相对于你的总资金一年转了多少次。套利交易是典型的高周转率投资，虽然单次投资收益不高但周转次数高，一年下来总体投资收益也很不错，高频交易是极端的套利交易，单次收益率只有千分之一甚至万分之一，但一个交易日可以做很多次交易，总体收益仍然十 …","date":1504475280,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":2100,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1504475280,"objectID":"f48e100cab8c69c9b239869fd75fc168","permalink":"https://bruce-qiao.github.io/post/how-to-make-wealth2/","publishdate":"2017-09-03T21:48:00Z","readingtime":5,"relpermalink":"/post/how-to-make-wealth2/","section":"post","tags":["投资","认知能力","如何创造财富"],"title":"如何创造财富（续）","type":"post","url":"/post/how-to-make-wealth2/","weight":0,"wordcount":2052},{"author":null,"categories":["Blog"],"content":"前两天围棋人机大战结束，阿尔法狗以3:0完胜目前等级分排名世界第一的柯洁。相信最近围绕这一话题媒体和舆论又会热闹一阵子。\n其实在比赛前了解人工智能的专家早就预料到了结果，我怀疑柯洁本人也知道，只是希望借此次比赛让更多的人关注围棋（据说阿尔法狗战胜李世石后韩国学习围棋的人增加了不少）。不管怎么说，人工智能在人类最复杂的棋类运动中完胜，标志着人工智能的发展进入一个新的阶段。不管你愿不愿意，人工智能今后都会成为一个无法逃避的话题。\n我最开始了解人工智能是通过罗辑思维（这点确实要感谢罗胖和罗辑思维让我认识了很多高人，例如笑来老师、吴军老师、万维刚老师以及学到了很多知识），当时罗辑思维要发行吴军老师的一本新书《智能时代》。\n吴军老师的书我之前就看过，《浪潮之巅》、《硅谷之谜》、《文明之光》等等，写的非常好。吴军老师本人是位计算机科学家，先后在谷歌、腾讯工作过，同时也是位高产的作家。吴军老师不仅擅长用通俗易懂的文字讲述科学历史和技术趋势，而且格局和眼光都非常独特，读完让人受益匪浅。强烈建议去看看，尤其是《文明之光》系列。\n当时为了推这本新书，罗辑思维用了一个有点标题党嫌疑的题目：如何成为2%的人。基于对吴军老师和罗辑思维的信任，我第一时间买了这本书并且在网上看了吴军老师关于这本书发行的一个视频。后来又陆陆续续看了一些有关人工智能的书籍和介绍，但这篇文章的主要内容都来自于吴军老师的这本《智能时代》。\n为什么风口很重要？ 雷军说过：“只要站在风口，猪都能飞上天。” 话糙理不糙。\n人类目前一共经历过三次技术革命，每次都给社会、经济、政治、个人等等各个方面带来了天翻地覆的变化。\n在第一次工业革命之前的两千年里，全世界各地人们的经济、生活水平没有太大的提高。而从第一次工业革命开始的18世纪到20世纪这短短的200多年时间里，人均GDP水平相对过去的2000年增长了将近20倍。\n马克思在《共产党宣言》里说过：\n资产阶级在它不到100年的阶级统治中所创造的生产力，比过去一切时代创造的全部生产力还要多，还要大。\n技术革命不仅带来了经济和生活水平的大幅增长，也给国家、企业和个体带来了前所未有的发展机遇。\n第一次技术革命起始于英国，以瓦特发明蒸汽机为代表。蒸汽机的出现是机器第一次大规模取代人力，极大地提高了生产力和生产效率。在之后的短短半个世纪里，英国从一个陆地面积只有全球千分之二，人口只有当时全 …","date":1495903860,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":4400,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1495903860,"objectID":"ae9ccf36f9f2202212ada0f116ef3f04","permalink":"https://bruce-qiao.github.io/post/ai-age/","publishdate":"2017-05-27T16:51:00Z","readingtime":9,"relpermalink":"/post/ai-age/","section":"post","tags":["读书笔记","认知能力"],"title":"人工智能——下一个风口","type":"post","url":"/post/ai-age/","weight":0,"wordcount":4365},{"author":null,"categories":["Blog"],"content":"前一阵收到新生大学的续费通知，才突然意识到自己加入新生大学社群已经有一年时间了。\n人生如白驹过隙，一年的时间转瞬即逝。然而在过去的短短一年时间里我有了非常大的变化：\n重新开始学习英语并且读完了六本英文原版书； 开始学习编程并且完成了新生大学全栈营的学习，现在开始学习第二门编程语言； 投资知识和技能有了大幅提升并且投资收益再创新高； 最近开始练习写作。 不过最大的收获是相比一年前心态发生了很大变化，由过去的焦虑不安变成现在的淡定、充实。\n在此之前很难想象短短一年内能够学习这么多的东西，有如此大的收获，也因此对自己过去浪费了那么多宝贵的时间而感到悔恨不已。\n而这一切转变都源自一个偶然的机会\u0026amp;hellip;\u0026amp;hellip;\n缘起 2014年年底我放弃了在别人看来相当不错的职位和收入，开始了以投资为主的自由职业生活。虽然在辞职前自以为做好了包括精神、物质上的各种准备，然而作为一个从一毕业就开始在企业工作的人来讲，刚刚辞职在家的那段时间还是非常的不适应。\n毕竟选择了一条“少有人走的路”，内心里虽然觉得放弃表面上安定、有保障的职业，选择做自己真正感兴趣的事情是对的，然而实际过程中却要面对对未来不确定性的担忧、希望速成带来的焦虑和周边亲人和朋友的疑虑和担心。2015一整年我都在这种焦虑和茫然交织的情绪中度过，期间看过不少书，也和一些人聊过，都没有特别大的启发。\n2015年春节刚过，一个偶然的机会我听到了罗胖的跨年演讲：《时间的朋友》。罗胖的演讲里提到了一本《把时间当作朋友》的书，猛然想起几年前公司的hr就推荐了这本书，也买了，但当时看到作者是个中国人，而且没什么名气，想着可能又是一本庸俗低劣的鸡汤励志书，就一直放着没有看过（成见有多坑啊）。\n于是第一时间开始读这本书，读着读着发现自己的很多问题在这本书里都找到了答案，真有种相逢恨晚的感觉。从此开始关注笑来老师的公众号、网上的各种文章，《把时间当作朋友》、《七年就是一辈子》这两本书我应该读了不下三遍并且认真写了读书笔记。越读这些文字越有收获，也越感觉到笑来老师真是个牛人。\n2015年4月某一天看到笑来老师在“学习学习再学习”公众号里说要建一个”新生大学”的收费社群，年费2555元。当时还真有点犹豫，毕竟2555不是一笔小钱，而且未来能从这个社群学到什么一点都不知道。但是凭着对笑来老师能力和人品的信任还是很快交了钱，成为了新生大学的一 …","date":1494963960,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":4300,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1494963960,"objectID":"5f34fd0afa35196532117e4c33ad1969","permalink":"https://bruce-qiao.github.io/post/reborn-anniversary/","publishdate":"2017-05-16T19:46:00Z","readingtime":9,"relpermalink":"/post/reborn-anniversary/","section":"post","tags":["认知能力"],"title":"新生周年纪","type":"post","url":"/post/reborn-anniversary/","weight":0,"wordcount":4286},{"author":null,"categories":["Blog"],"content":"这是一篇读书笔记，书名叫做《a mind for numbers》，国内译作《学习之道》，是我读完的第六本英文原版书。\n最早听到这本书是在Xdite老师的元学习课上，Xdite老师的元学习理论借鉴了这本书的一些方法。当时就去听了作者在Ted上的一个演讲，感觉理论很新颖，后来就忙着学编程去了。直到最近编程学习告一段落，自己通过全栈营的学习对元学习理论有了进一步的认识，觉得有必要更加深入地了解理论背后更多的内容，于是认真地读了一遍这本书。\n这本书的作者结合自己的经历、最新的认知科学理论和优秀的教育、学习实践总结了一套如何高效学习数学和科学的方法论，不仅适合学生、老师和家长，对于任何希望终身学习的成年人也很有启发。书里的很多思想和方法可能会颠覆你过去对于学习的理解和认识，但实践证明是非常有效的。以下是我个人提取的一些要点：\n信心 任何人都可以学好数学（科学）！\n你没看错，是任何人！\n作者芭芭拉·奥克利本人的经历就是一个数学（科学）学渣逆袭的传奇故事。作为一个从小连遥控器都不会用的女孩，奥克利上学的时候数学和理科成绩很差，后来凭借出色的语言能力（其实也不是什么天赋，就是没有恐惧心理，越学越好不断获得正反馈的结果）上了大学，专业是俄语。毕业后加入美国军队，被派往当时的西德从事情报工作，身边的同事除了她之外都是电子或通讯专业背景。奥克利很羡慕同事们能够熟练地解决工作中的数学和技术问题，于是退伍后她选择和十几岁的高中生一起重新开始学习数学和科学。结果怎么样？奥克利最后获得了系统工程学的博士学位，现在是一名大学工程学教授。\n奥克利用自己的亲身经历证明了不论性别、天赋和任何背景都能学好数学和科学。书里还有很多类似的例子。\n无独有偶，笑来老师在一篇文章里也讲了一个类似的故事：\n2009 年，有一个小女孩，名字叫高雅，背着个包从大连坐火车来北京找我，说要学 TOEFL，要到国外读大学。我就给她安排了课程，她很努力，几次下来，从最初的 62 分，考到了最终的 102 分（满分 120 分）。去美国之前，她问我到了美国该学什么专业，我告诉他，本科就是学基础学科的，比如数学。她当时脱口而出：“我从小就数学不好……” 我颇不耐烦，因为我向来讨厌 “我从小 …… 就不好” 这个句型（有一类句型，是脑子被污染了的人才频繁使用的），于是就直接厉声顶了回去：“谁说的！” 我本来说的是感叹号，她却理解成了 …","date":1494345180,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":4500,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1494345180,"objectID":"55a42e8e312dcf75b27df1d26076e9d4","permalink":"https://bruce-qiao.github.io/post/learning-how-to-learn/","publishdate":"2017-05-09T15:53:00Z","readingtime":9,"relpermalink":"/post/learning-how-to-learn/","section":"post","tags":["认知能力","读书笔记"],"title":"学习如何学习","type":"post","url":"/post/learning-how-to-learn/","weight":0,"wordcount":4478},{"author":null,"categories":["Blog"],"content":"前两周参考笑来老师文章用hexo建了一个静态博客站点，准备正式开始练习写作（顺便说一下笑来老师的这个博客有很多学习编程的心得、实用知识和技巧，非常值得看看）。\n写作过程中发现hexo中对markdown语法的支持有些问题。例如使用引用语法的时候，在atom里模拟显示正常：\n但在浏览器里却显示有问题：\n反复试了多次都是同样的问题，正在一筹莫展时，同样是受笑来老师博客里的一篇文章的启发最终解决了这个问题。\n谷歌chrome浏览器的Inspect功能对于发现和修正html/css问题非常有效。以上面的问题为例：\n在网页的有问题位置按鼠标右键，在弹出菜单里选择Inspect； 这时会弹出Inspect窗口。窗口左侧是网页的html文件内容，可以看到引用的部分是属于一个blockquote的class； 用鼠标点击这个class或者在右边窗口中输入blockquote，可以看到对应的css文件； 仔细看看这个文件就会发现这种格式显示的肯定不是引用的效果： .article-entry blockquote { font-family: Georgia, \u0026amp;#34;Times New Roman\u0026amp;#34;, serif; font-size: 1.4em; margin: 1.6em 20px; text-align: center; } 找一个能够正常显示引用的网页，同样用Inspect功能打开css文件，看看引用部分的css是怎么写的： 把css文件内容拷贝下来，粘贴到自己有问题网页的对应css文件中，发现网页可以正确显示引用了（可以随便试试各种效果，试不坏的）： 最后一步，在hexo所在文件夹里搜索blockquote（在atom里用\u0026amp;rsquo;shift+command+F\u0026amp;rsquo;快捷键搜索），css设置一般都在‘style.css’文件里，将对应的部分换成以下内容就行了： .article-entry blockquote { padding: 0 15px; color: #666; border-left: 4px solid #ddd; } 总结 Inspect功能对于学习、发现和修正html/css问题非常方便、有效； 对于html/css/javascript还是缺乏系统了解，需要尽快补上。 问题 修改完后用手机浏览博客能够立刻正常显示，但在电脑上需 …","date":1494102780,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":900,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1494102780,"objectID":"a0046d17661303a24632376275a2905b","permalink":"https://bruce-qiao.github.io/post/hexo-markdown-debug/","publishdate":"2017-05-06T20:33:00Z","readingtime":2,"relpermalink":"/post/hexo-markdown-debug/","section":"post","tags":["hexo","markdown","debug"],"title":"用Inspect功能修正hexo排版错误","type":"post","url":"/post/hexo-markdown-debug/","weight":0,"wordcount":893},{"author":null,"categories":["Blog"],"content":"程序报错了！ 初学编程者最大的噩梦就是遇到程序报错，辛苦半天敲完一行行代码，满怀期望地按下运行键等来的却是满屏红字。\n尤其是在折腾了大半天仍然解决不了问题，或者遇到一直出错的情况，真想摔键盘、骂人！继而怀疑自己是不是适合学编程，严重的甚至因此放弃。\n然而当你咬牙坚持一阵子，就会发现出错的机会越来越少；出现错误时也不像最开始有那么大的反应，开始静下心来查找错误，最后发现大多数居然都是拼写错误，还有一小部分是没有按照教材的要求去做。\n直到有一天你终于可以做到面对错误心如止水，检查拼写、上google找答案或者向高手请教，问题往往很快就能解决，你甚至感觉自己简直就是不世出的编程奇才，回想当时错误出现时气急败坏的样子，有恍如隔世的感觉。\n为什么会这样？\n全栈营xdite老师说的很好：\n这样说吧，当各位在入门编程时，最常遇到的一个状况：老是遇到红画面报错。几次下来，就会开始质疑自己是不是猪脑袋，怎么会这么容易出错，是不是人生失败组。 这是因为过去在人生中，其实是「少有人当面指出你的错误」，所以一旦自己收到很多「反馈」，就会立即反射到自己「容易犯错」，容易陷入深深的挫败。 但编程的「错误讯息」其实是「不带情绪」的「真实反馈」，如果定神一看，会发现也只是一般的英文而已。可能提示你少打几个字，或拼错字而已。改掉就没事了。\n人生又何尝不是如此。 在学生时代，我们的主要任务是学习，成绩是最好的反馈，这种反馈很直接也很及时。\n步入社会，反馈变得不那么直接了。比如你在一家公司打工，上级或同事对于你的错误是不可能毫无保留地、直截了当地指出来的；同样的情况也出现在和家人的相处过程中。\n尤其是在个人成长方面，我们几乎得不到任何反馈。时间久了，你会对自己身上的问题毫无察觉，同时对偶尔的批评意见（报错信息）产生抵触，甚至对给你提意见的人心生不满。殊不知这正是宝贵的反馈信息啊！\n另一种情况是害怕出错，觉得出错很丢人，很受伤，这在表现型人格的人群中经常出现。殊不知没人不犯错，没人天生什么都会，不断报错、纠错才能很快提升水平。\n长期缺乏有效反馈和害怕出错导致我们在个人事业、生活遭遇重大挑战时，要么自暴自弃，要么怪罪别人（我在被bug折磨的时候就想过是不是老师有意挖坑害我），很难做到客观地面对和解决问题；在机会来临时畏手畏脚，不敢大胆尝试。\n唯一与编程比较类似的可能要算是创业了。在创业过程中，没有从不适岗到 …","date":1493309460,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":1300,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1493309460,"objectID":"49322fa54d695130b5e40e0562d78b20","permalink":"https://bruce-qiao.github.io/post/bug-and-debug/","publishdate":"2017-04-27T16:11:00Z","readingtime":3,"relpermalink":"/post/bug-and-debug/","section":"post","tags":["编程","认知能力"],"title":"今天你的人生报错了吗？","type":"post","url":"/post/bug-and-debug/","weight":0,"wordcount":1247},{"author":null,"categories":["Blog"],"content":"这不是一篇原创文章，实际上是一篇读书笔记。这本书叫《黑客与画家》，作者是Paul Graham是一名知名程序员、创业者、硅谷著名的YC孵化器的创始人之一。“如何创造财富”是这本书的一篇文章，看完以后觉得很受启发，所以有了这篇读书笔记。\n创造财富的基本原理 普通人如何创造财富（快速致富）？其实原理超级简单，就是一个简单的数学公式。\n假设你是一名程序猿，在一家大公司上班，年薪8万刀，这也是业界的平均工资水平。考虑以下假设：\n如果你愿意比别的员工多工作一倍的时间； 如果足够高效，你的效率是别人的三倍（考虑到大公司拖沓、轻松的工作节奏，是完全可以实现的）； 你愿意同时从事两个人的工作； 你比别人聪明三倍。 综合以上因素，也就是把上面的倍数相乘得到36倍，8万的36倍接近300万，你发财了！\n然而实际上如果你把这个想法告诉你的老板并要求他按照这个标准给你发工资的时候，即使你没被开掉也会被当成精神不正常。\n可是上面的假设在创业公司是完全有可能实现的，实际上创业公司也就是这样干的：聚集行业最聪明、最有能力的一批人，一个人身兼数职，每天工作十几个小时以上\u0026amp;hellip;\u0026amp;hellip;\n这个超级简单的公式背后隐藏着一个基本的原理：选择创业无非是愿意把普通人一生的工作时间压缩到了短短几年。\n如果你没有过人的能力，也不愿意过天天加班没有节假日的生活，无法承受失败的痛苦，那么最好选择找一个大公司工作几十年，平稳地度过这一生。\n如果你无法忍受日复一日、年复一年的单调、枯燥工作，而是要享受在短时间内财富快速增加的好处，那么同时必须承受相应的压力和痛苦。\n很公平。\n大公司的问题 大公司的最大问题在于不能精确地衡量每个人的贡献，继而无法根据每个人的贡献提供个性化的薪酬。\n这是由于大公司提供产品或服务的复杂程度以及规模效应等等问题造成的。你很难说iphone大卖是哪个部门或个人的贡献，这里面牵扯到软件、硬件、外观设计、营销、推广等很多方面。正是因为这个原因，大公司提供给每个员工的薪酬可能是个接近平均数的水平。\n这对于普通员工没有问题，但对于真正有能力的人可能是个大问题。\n大公司里有两种人受这种影响相对较小。一种是CEO，因为公司的表现就是他的表现，很容易衡量；还有一种是销售人员，尤其是薪酬和销量挂钩的销售人员，他们的表现也相对比较好衡量。\n创造财富的两个要素 创造财富的第一个要素是个人业绩可衡量。 …","date":1492965360,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":1800,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1492965360,"objectID":"0d52776b44b58bf1deddc47d34093a77","permalink":"https://bruce-qiao.github.io/post/how-to-make-wealth/","publishdate":"2017-04-23T16:36:00Z","readingtime":4,"relpermalink":"/post/how-to-make-wealth/","section":"post","tags":["读书笔记","黑客","认知能力","如何创造财富"],"title":"如何创造财富","type":"post","url":"/post/how-to-make-wealth/","weight":0,"wordcount":1728},{"author":null,"categories":["Blog"],"content":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.\nQuick Start Create a new post $ hexo new \u0026amp;#34;My New Post\u0026amp;#34; More info: Writing\nRun server $ hexo server More info: Server\nGenerate static files $ hexo generate More info: Generating\nDeploy to remote sites $ hexo deploy More info: Deployment\n","date":1492964400,"dir":"post/","expirydate":-62135596800,"fuzzywordcount":100,"html":"","keywords":null,"kind":"page","lang":"en","lastmod":1492964400,"objectID":"149146edb9d37107f2905b865ce6ae17","permalink":"https://bruce-qiao.github.io/post/hello-world/","publishdate":"2017-04-23T16:20:00Z","readingtime":1,"relpermalink":"/post/hello-world/","section":"post","tags":null,"title":"Hello World","type":"post","url":"/post/hello-world/","weight":0,"wordcount":78}]